data_definitions = [
    ("""
        INSERT INTO authors (author_full_name) VALUES
            ('Энди Вейр'), ('Агата Кристи'), ('Карлос Руис Сафон'), ('Джейн Остин'), ('Мольер'),
            ('Эрих Мария Ремарк'), ('Фридрих Ницше'), ('Марк Аврелий'),('Эрик Берне');""", "authors_data"),
    ("""
        INSERT INTO genres (genre_name) VALUES
            ('Фантастика'), ('Детектив'), ('Роман'),
            ('Комедия'), ('Философия'),('Психология');""", "genres_data"),
    ("""
        INSERT INTO books (title, author_id, availability, genre_id) VALUES
            ('Марсианин', 1, FALSE, 1), ('Убийство в Восточном экспрессе', 2, FALSE, 2),
            ('Тень ветра', 3, TRUE, 2), ('Гордость и предубеждение', 4, TRUE, 3),
            ('Тартюф', 5, FALSE, 4), ('Три товарища', 6, FALSE, 4),
            ('Так говорил Заратустра', 7, FALSE, 5), ('Размышления', 8, TRUE, 5),
            ('Игры, в которые играют люди', 9, TRUE, 6), ('Воля к власти', 7, FALSE, 5),
            ('Экклесиа гоминис', 7, TRUE, 5), ('Сумерки идолов', 7, FALSE, 5),
            ('Ориент Экспресс', 2, FALSE, 2), ('Смерть на Ниле', 2, TRUE, 2),
            ('Загадка желтых ирисов', 2, FALSE, 2);""", "books_data"),
    ("""
        INSERT INTO customers (customer_full_name, date_of_birth, address, phone_number) VALUES
            ('Петров Петр Петрович', '1980-05-15', 'ул. Ленина, д. 20, кв. 3', '+79123456789'),
            ('Козлов Игорь Николаевич', '1988-12-03', 'ул. Советская, д. 5, кв. 12', '+79876543210'),
            ('Иванова Ольга Александровна', '1975-04-10', 'ул. Пушкина, д. 8, кв. 2', '+79998887766');""", "customers_data"),
    ("""
        INSERT INTO users (email, hashed_password) VALUES
            ('admin@admin.net', '$2b$12$FMFO3yOKFzYh5wJ5pZa7J.9nnarqHOnGtOR4/K0ufuFsSXsAAjx0O');""", "users_data"),
    ("""
    INSERT INTO book_transactions (book_id, customer_id, transaction_date, expected_return_date, returned_date) VALUES
        (1, 1, '2022-01-03', '2022-02-02', null),
        (2, 2, '2022-02-10', '2022-03-12', null),
        (15, 2, '2022-03-10', '2022-04-09', null),
        (3, 2, '2022-03-15', '2022-04-14', '2022-04-10'),
        (3, 3, '2022-04-20', '2022-05-20', '2022-05-25'),
        (14, 2, '2022-04-29', '2022-05-29', '2022-06-27'),
        (3, 1, '2022-06-01', '2022-06-30', null),
        (13, 2, '2022-06-04', '2022-07-04', '2022-07-08'),
        (13, 3, '2022-07-08', '2022-08-07', null),
        (4, 1, '2022-06-21', '2022-07-21', '2022-08-12'),
        (12, 3, '2022-07-17', '2022-08-16', null),
        (5, 3, '2022-07-29', '2022-08-28', null),
        (6, 2, '2022-08-11', '2022-09-10', '2022-09-02'),
        (6, 3, '2022-09-02', '2022-10-02', null),
        (11, 3, '2022-09-08', '2022-10-08', '2022-10-02'),
        (7, 1, '2022-09-25', '2022-10-25', null),
        (10, 1, '2022-11-03', '2022-12-03', null),
        (8, 1, '2022-11-09', '2022-12-09', '2022-12-28'),
        (9, 3, '2022-12-21', '2023-01-20', '2023-02-16');""", "book_transactions_data")
]
